app/controllers/categories_controller.rb

  def show
    @posts = Post.where(category_id: @category)
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 1]]